; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph1 - mode
	infrared0 - mode
	spectrograph3 - mode
	infrared2 - mode
	Star2 - direction
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet21)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon17)
	(supports instrument7 spectrograph3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet22)
)
(:goal (and
	(pointing satellite0 Planet22)
	(pointing satellite2 Planet9)
	(have_image Phenomenon4 infrared2)
	(have_image Star5 thermograph1)
	(have_image Star6 spectrograph3)
	(have_image Planet7 infrared2)
	(have_image Star8 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Planet10 thermograph1)
	(have_image Planet11 spectrograph3)
	(have_image Phenomenon12 infrared2)
	(have_image Planet13 infrared0)
	(have_image Phenomenon14 thermograph1)
	(have_image Phenomenon15 spectrograph3)
	(have_image Planet16 thermograph1)
	(have_image Phenomenon17 infrared2)
	(have_image Planet18 infrared0)
	(have_image Star19 infrared0)
	(have_image Planet21 thermograph1)
	(have_image Planet22 infrared2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 20
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 20
3. (turn_to satellite4 planet13 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet13)
   goals met: 0 of 20
4. (turn_to satellite4 star1 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 star1)
   goals met: 0 of 20
5. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 20
6. (turn_to satellite4 phenomenon15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 20
7. (take_image satellite4 phenomenon15 instrument7 spectrograph3)
   added: (have_image phenomenon15 spectrograph3)
   goals met: 1 of 20
8. (turn_to satellite4 planet11 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet11)
   goals met: 1 of 20
9. (take_image satellite4 planet11 instrument7 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 2 of 20
10. (turn_to satellite4 planet13 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet13)
   goals met: 2 of 20
11. (take_image satellite4 planet13 instrument7 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 3 of 20
12. (turn_to satellite4 planet18 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet18)
   goals met: 3 of 20
13. (take_image satellite4 planet18 instrument7 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 4 of 20
14. (turn_to satellite4 planet9 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet9)
   goals met: 4 of 20
15. (take_image satellite4 planet9 instrument7 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 5 of 20
16. (turn_to satellite4 star19 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star19)
   goals met: 5 of 20
17. (take_image satellite4 star19 instrument7 infrared0)
   added: (have_image star19 infrared0)
   goals met: 6 of 20
18. (turn_to satellite4 star6 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star6)
   goals met: 6 of 20
19. (take_image satellite4 star6 instrument7 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 7 of 20
20. (turn_to satellite3 groundstation0 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 groundstation0)
   goals met: 7 of 20
21. (calibrate satellite3 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 7 of 20
22. (turn_to satellite3 phenomenon12 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon12)
   goals met: 7 of 20
23. (take_image satellite3 phenomenon12 instrument6 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 8 of 20
24. (turn_to satellite3 phenomenon14 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon14)
   goals met: 8 of 20
25. (take_image satellite3 phenomenon14 instrument6 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 9 of 20
26. (turn_to satellite3 phenomenon17 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon17)
   goals met: 9 of 20
27. (take_image satellite3 phenomenon17 instrument6 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 10 of 20
28. (turn_to satellite3 phenomenon4 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon4)
   goals met: 10 of 20
29. (take_image satellite3 phenomenon4 instrument6 infrared2)
   added: (have_image phenomenon4 infrared2)
   goals met: 11 of 20
30. (turn_to satellite3 planet10 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 planet10)
   goals met: 11 of 20
31. (take_image satellite3 planet10 instrument6 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 12 of 20
32. (turn_to satellite3 planet16 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet16)
   goals met: 12 of 20
33. (take_image satellite3 planet16 instrument6 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 13 of 20
34. (turn_to satellite3 planet21 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet21)
   goals met: 13 of 20
35. (take_image satellite3 planet21 instrument6 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 14 of 20
36. (turn_to satellite3 planet22 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 planet22)
   goals met: 14 of 20
37. (take_image satellite3 planet22 instrument6 infrared2)
   added: (have_image planet22 infrared2)
   goals met: 15 of 20
38. (turn_to satellite3 planet7 planet22)
   deleted: (pointing satellite3 planet22)
   added: (pointing satellite3 planet7)
   goals met: 15 of 20
39. (take_image satellite3 planet7 instrument6 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 16 of 20
40. (turn_to satellite3 star5 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star5)
   goals met: 16 of 20
41. (take_image satellite3 star5 instrument6 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 17 of 20
42. (turn_to satellite3 star8 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star8)
   goals met: 17 of 20
43. (take_image satellite3 star8 instrument6 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 18 of 20
44. (turn_to satellite2 planet9 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet9)
   goals met: 19 of 20
45. (turn_to satellite0 planet22 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet22)
   goals met: 20 of 20
